---
kind: type
id: T:Autodesk.Revit.DB.Visual.StonePatternType
source: html/98a8f155-8aea-cb90-7aa6-9b530a563159.htm
---
# Autodesk.Revit.DB.Visual.StonePatternType

The enumerated type representing the permitted values for the asset property "StonePattern" from the "Stone" schema.

## Syntax (C#)
```csharp
public enum StonePatternType
```